app/controllers/articles_controller.rb

SELECT * FROM "articles" ORDER BY created_at DESC
---
  def index
    @articles = Article.all(:order => "created_at DESC")

INSERT INTO "articles" ("permalink", "intro", "created_at", "title", "body", "published", "updated_at", "tinyurl", "comments_count", "image", "source_id") VALUES('-dsa-13123', 'dasddd', '2011-05-10 20:05:00', 'Ttiasda', 'dasd', 'f', '2011-05-10 20:05:43', '', 0, 'dasdad', NULL)
---
  def create
    @article = Article.new(params[:article])
    if params[:article_preview] || !@article.save

SELECT * FROM "articles" WHERE ("articles"."id" = 285)
UPDATE "articles" SET "updated_at" = '2011-05-10 20:36:31', "permalink" = 'assdffasd908[''asvz/dsff' WHERE "id" = 286
---
  def update
    params[:article][:writer_ids] ||= []
    params[:article][:category_ids] ||= []
    @article = Article.find(params[:id])
    if params[:article_preview] || !@article.update_attributes(params[:article])