app/controllers/banners_controller.rb

SELECT * FROM "banners"
---
  def index
    @banners = Banner.all

SELECT * FROM "banners" WHERE ("banners"."id" = 1)
---
  def show
    @banner = Banner.find(params[:id])

SELECT * FROM "banners" WHERE ("banners"."id" = 1)
---
  def edit
    @banner = Banner.find(params[:id])

INSERT INTO "banners" ("created_at", "published", "updated_at", "url", "image") VALUES('2011-05-10 20:59:48', 't', '2011-05-10 20:59:48', 'http://jabolko-blog.dev/', 'http://jabolko-blog.dev/images/banners/najava_razvijalcev.jpg?1287334412')
---
  def create
    @banner = Banner.new(params[:banner])

    respond_to do |format|
      if @banner.save

SELECT * FROM "banners" WHERE ("banners"."id" = 1)
UPDATE "banners" SET "updated_at" = '2011-05-10 21:06:50', "published" = 'f' WHERE "id" = 1
---
  def update
    @banner = Banner.find(params[:id])

    respond_to do |format|
      if @banner.update_attributes(params[:banner])