app/controllers/blog_controller.rb

  def articles
    if params[:permalink]
      # za kategorije
      @category = Category.find_by_permalink(params[:permalink])
---
SELECT * FROM "categories" WHERE ("categories"."permalink" = 'novice') LIMIT 1